app/views/main/results.html.erb

    <h2 class='center'>Results</h2>
    <% Event.all.order("date").last(5).each do |event| %>
---
SELECT `events`.* FROM `events`   ORDER BY date