app/views/event/show.html.erb

            	<%z=calculate_best(@event,0)%>
                <h4 class="righttext"><a href="/team/<%= School.find_by_name(z)%>"><%=z%></a></h4>
---
SELECT  `schools`.* FROM `schools`  WHERE `schools`.`name` = 'Woodson Highschool' LIMIT 1