app/controllers/event_controller.rb

SELECT  `events`.* FROM `events`  WHERE `events`.`id` = ? LIMIT 1  [["id", 8]]
---
  def show
    @event = Event.find(params[:id])

INSERT INTO `events` (`best`, `created_at`, `date`, `geo`, `honorable`, `location`, `name`, `outstanding`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    if request.post? and params[:event]
      @event=Event.new(event_params) #temp user
 	  	 if @event.name==nil or @event.name ==""
 	  	    flash[:notice]="Event name Can not be blank."
 	  	 	  redirect_to :action => "register", :controller =>"main"
 	  	    return 0
 	  	 end
 	  	  if @event.date==nil or @event.date ==""
 	  	    flash[:notice]="Date Can not be blank."
 	  	 	  redirect_to :action => "register", :controller =>"main"
 	  	    return 0
 	  	 end
 	  	 @event.location = "#{current_user.name} #{current_user.location}"
 	  	 z= Geokit::Geocoders::MultiGeocoder.geocode(location)
 	  	 @event.geo = z.ll#do this
 	  	 @event.best=0
 	  	 @event.outstanding=0
 	  	 @event.honorable=0
 	  	 months = {"January"=>"01","February"=>"02","March"=>"02","April"=>"04","May"=>"05","June"=>"06","July"=>"07","August"=>"08","September"=>"09","October"=>"10","November"=>"11","December"=>"12"}
 	  	 @event.date = "#{months[@event.date.split(' ')[0]]} #{@event.date}"
 	  	 if @event.save