app/controllers/main_controller.rb

    def index
        @events = Event.all;
---
SELECT `events`.* FROM `events`   ORDER BY date

    def events
         @events = Event.all;
---
SELECT `events`.* FROM `events`   ORDER BY date

    def results
        @events = Event.all;
---
SELECT `events`.* FROM `events`   ORDER BY date

    def teams
        @teams = School.all;
---
SELECT `schools`.* FROM `schools`   ORDER BY score