app/controllers/team_controller.rb

  def show
    @team = School.find(params[:id])
---
SELECT  `schools`.* FROM `schools`  WHERE `schools`.`id` = ? LIMIT 1  [["id", 1]]